I am using this opportunity to explore the pandas library, courtesy of [General Assembly's course](https://github.com/justmarkham/DAT8#class-4-exploratory-data-analysis), which lead me to a nice piece of [sample code](https://github.com/justmarkham/DAT8/blob/master/code/04_pandas.py).

In [3]:
import pandas as pd

u = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|', index_col='user_id')

In [29]:
u.shape

(943, 4)

In [26]:
u.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [6]:
u.describe() # numeric only

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [7]:
u.describe(include=['object']) # object only

       gender occupation zip_code
count     943        943      943
unique      2         21      795
top         M    student    55414
freq      670        196        9

In [16]:
u.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [22]:
u[u.occupation=="homemaker"].sort_values('age')

         age gender occupation zip_code
user_id
35        20      F  homemaker    42459
898       23      M  homemaker    61755
708       26      F  homemaker    96349
356       32      F  homemaker    92688
362       35      F  homemaker    85233
20        42      F  homemaker    95660
722       50      F  homemaker    17331

In [36]:
u.groupby('gender').describe(include=['object'])

              occupation zip_code
gender
F      count         273      273
       unique         20      251
       top       student    20009
       freq           60        3
M      count         670      670
       unique         21      589
       top       student    55414
       freq          136        6

In [50]:
u.groupby('occupation').age.mean().sort_values()

occupation
student          22.081633
none             26.555556
entertainment    29.222222
artist           31.392857
homemaker        32.571429
programmer       33.121212
technician       33.148148
other            34.523810
scientist        35.548387
salesman         35.666667
writer           36.311111
engineer         36.388060
lawyer           36.750000
marketing        37.615385
executive        38.718750
administrator    38.746835
librarian        40.000000
healthcare       41.562500
educator         42.010526
doctor           43.571429
retired          63.071429
Name: age, dtype: float64

In [59]:
pd.crosstab(u.gender,u.occupation)

occupation,administrator,artist,doctor,educator,engineer,entertainment,executive,healthcare,homemaker,lawyer,...,marketing,none,other,programmer,retired,salesman,scientist,student,technician,writer
gender,,,,,,,,,,,,,,,,,,,,,
F,36,13,0,26,2,2,3,11,6,2,...,10,4,36,6,1,3,3,60,1,19
M,43,15,7,69,65,16,29,5,1,10,...,16,5,69,60,13,9,28,136,26,26